Revit 2024 API
AssemblyDifferenceNone Class
 The two assemblies being compared are identical
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class AssemblyDifferenceNone : AssemblyDifference
Visual Basic
Public Class AssemblyDifferenceNone _
	Inherits AssemblyDifference
Visual C++
public ref class AssemblyDifferenceNone : public AssemblyDifference
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyDifference
 Autodesk.Revit.DB.AssemblyDifferenceNone
See Also
AssemblyDifferenceNone Members
Autodesk.Revit.DB Namespace